Revit 2027 API
ExportPDFSettings.SetOptions Method
 Sets options for exporting.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetOptions(
	PDFExportOptions options
)
Public Sub SetOptions (
	options As PDFExportOptions
)
public:
void SetOptions(
	PDFExportOptions^ options
)
member SetOptions :
        options : PDFExportOptions -> unit
Parameters
options PDFExportOptions
 Other options.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportPDFSettings Class
Autodesk.Revit.DB Namespace